<div class="entry-content">
								<h1>Hva er &#9835; &#9834;&#160;Odometer og hvorfor trenger jeg det?</h1>
<div>
<p><em>&#9835; &#9834; (Pling Plong) Odometer</em> er et program som forenkler <strong>rapportering av musikkbruk p&#229; TV</strong>.</p>
<p><img class="alignright size-large wp-image-16445" style="border-style: initial; border-color: initial;" title="&#9835; &#9834; Odometer har lastet inn en sekvens og funnet fram til musikksporene" src="http://hjelp/wp-content/uploads/Skjermbilde-2012-05-11-kl.-09.24.46-745x617.png" alt="Pling Plong Odometer i bruk" width="596" height="494"></p>
<p>&#160;</p>
</div>
<div>
<ol><li>Programmet analyserer innholdet i en tidslinje fra Final Cut Pro, og regner ut den <strong>h&#248;rbare varigheten for hvert musikkspor</strong>.</li>
<li>For hvert musikkspor <strong>innhentes den info (<em>metadata</em>) som beh&#248;ves</strong> for musikkrapportering.</li>
<li>Musikkrapporter <strong>sendes med ett klikk</strong>.</li>
<li>Tekst til <strong>rulletekst</strong> kan ogs&#229; lages.</li>
</ol><p>&#160;</p>
<p>P&#229; denne m&#229;ten vil du <strong>spare enormt med tid</strong>, tid som du kan bruke til &#229; lage innhold. Det vil ogs&#229; gi en <strong>konsekvent musikkrapportering</strong>,&#160;siden programmets algoritmer s&#248;rger for at alt rapporteres p&#229; lik m&#229;te. Og <strong>musikken vil f&#248;lge programmet</strong> i Programbanken, som gj&#248;r at det&#160;blir <strong>lettere for andre &#229; bruke deler av programmet</strong>.</p>
<p>S&#229; la oss sette datamaskinene til &#229; gj&#248;re det&#160;datamaskinene kan best, s&#229; kan vi mennesker heller lage TV enn timesvis med utregning og repetetivt arbeid!</p>
</div>
<h1>Installere og starte programmet</h1>
<p>Det finnes for b&#229;de Windows og Mac OS X.&#160;Hvis du ikke er sikker p&#229; om du har programmet installert. Se etter dette ikonet:&#160;<a href="http://hjelp/wp-content/uploads/Skjermbilde-2012-05-11-kl.-09.13.481.png"><img class="size-thumbnail wp-image-16448 alignnone" title="Logoen til &#9835; &#9834; Odometer" src="http://hjelp/wp-content/uploads/Skjermbilde-2012-05-11-kl.-09.13.481-64x64.png" alt="" width="64" height="64"></a></p>
<div>
<h2>OS X</h2>
</div>
<div id="attachment_16468" class="wp-caption aligncenter" style="width: 255px"><a href="http://hjelp/wp-content/uploads/Skjermbilde-2012-05-11-kl.-13.55.45.png"><img class="size-medium wp-image-16468 " style="border-style: initial; border-color: initial;" title="Odometer installert i Absolute Manage" src="http://hjelp/wp-content/uploads/Skjermbilde-2012-05-11-kl.-13.55.45-350x257.png" alt="" width="245" height="180"></a><p class="wp-caption-text">Odometer installert i Absolute Manage</p></div>
<p>Programmet kan <a title="Programvare ved behov" href="http://hjelp/programvare/">installeres og oppdateres uten admin-rettigheter gjennom Absolute Manage</a></p>
<div>
<h2>Windows</h2>
<p>Forel&#248;pig m&#229; du hente programmet selv, p&#229; internett. <a href="http://dl.dropbox.com/u/12128173/odometer-2012-05-06.exe">Her finner du siste versjon</a></p>
</div>
<h1>Klargj&#248;re XML fra Final Cut Pro</h1>
<div>
<p>Den aktuelle tidslinja (en <em>sequence</em>) i Final Cut Pro m&#229; eksporteres i XML-format for at Odometer skal kunne jobbe med det.</p>
<p style="text-align: left;">
</p><div id="attachment_16479" class="wp-caption aligncenter" style="width: 360px"><a href="http://hjelp/wp-content/uploads/Skjermbilde-2012-05-11-kl.-14.32.40.png"><img class="size-medium wp-image-16479" title="Eksportere en sequence i Final Cut Pro" src="http://hjelp/wp-content/uploads/Skjermbilde-2012-05-11-kl.-14.32.40-350x310.png" alt="" width="350" height="310"></a><p class="wp-caption-text">Ctrl-klikk p&#229; en sequence og velg Export&#8594;XML</p></div>
<p>Det er tilstrekkelig med <em>XMEML version 1</em>, det g&#229;r nemlig betydelig raskere for kompliserte tidslinjer.</p>
<p><a href="http://hjelp/wp-content/uploads/Skjermbilde-2012-05-11-kl.-14.06.34.png"><img class="aligncenter size-medium wp-image-16472" title="Export til XML (xmeml version 1)" src="http://hjelp/wp-content/uploads/Skjermbilde-2012-05-11-kl.-14.06.34-350x209.png" alt="" width="350" height="209"></a></p>
<p>XML-fila m&#229; lagres p&#229; et sted du finner den igjen.</p>
</div>
<h1>Importere XML</h1>
<div>
<p>Du kan f&#244;re Odometer med XML-fila p&#229; to m&#229;ter:</p>
<ol><li>Ved &#229; dra-og-slippe fila inn i programmet</li>
<li>Ved &#229; finne den med programmets <em>&#197;pne fil&#8230;</em>-knapp</li>
</ol><p>&#197;kke som vil Odometer starte &#229; tygge seg gjennom tidslinja, finne fram til det som er importert lyd, og starte &#229; sl&#229; opp <strong>metadata for de spor som programmet&#160;kjenner igjen</strong>. Det siste m&#229; nok forklares n&#230;rmere:</p>
<h2>Automatisk innhenting av metadata</h2>
<p>Til musikkrapporteringa beh&#248;ves <em>metadata</em> om hvert spor, det vil si info som <em>tittel</em>, <em>artist</em>, <em>plateselskap</em> etc.<br>
Dette innhentes automatisk p&#229; internett for de musikk-kutt som har filnavn som kan utledes til en identifiserende adresse.</p>
<p>Det er to ting som m&#229; til for at magien skal virke.</p>
<ol><li>Datamaskinen som du kj&#248;rer programmet p&#229; <strong>m&#229; v&#230;re tilkoblet internett.</strong></li>
<li>Alle musikk-kutt som er lastet ned fra DMA eller AUX <strong>m&#229; beholde de originale filnavnene</strong>. (Hvis noen har byttet format p&#229; lyden, for eksempel fra .wav til .mp3, for &#229; gj&#248;re Final Cut Pro lykkelig, m&#229; det nye filnavnet starte med samme filnavn)</li>
</ol></div>
<p>&#160;</p>
<div id="attachment_16449" class="wp-caption aligncenter" style="width: 705px"><a href="http://hjelp/wp-content/uploads/Skjermbilde-2012-05-11-kl.-09.30.12.png"><img class="size-full wp-image-16449 " title="&#9835; &#9834; Odometer henter ut n&#248;dvendig metadata for alle musikksporene" src="http://hjelp/wp-content/uploads/Skjermbilde-2012-05-11-kl.-09.30.12.png" alt="" width="695" height="199"></a><p class="wp-caption-text">&#9835; &#9834; Odometer har funnet metadata for alle spor. Dobbelklikk linja for &#229; se detaljer, dobbelklikk p&#229; varigheten for &#229; justere den.</p></div>
<p>N&#229;r du ser at metadata har blitt funnet i alle linjene, kan du g&#229; videre.</p>
<h1>PRF-rapportering</h1>
<div>
<p>All musikk vi bruker skal rapporteres til TONO, og for TV-produksjoner gj&#248;res det gjennom <em>PRF</em>. Ett trykk p&#229; <em>PRF-rapport</em>-knappen gir et nytt vindu med en <strong>oversikt over all musikkbruk</strong>, i et format som kan sendes videre til den personen som faktisk skal punche infoen inn i PRF.</p>
<p style="text-align: center;"><a href="http://hjelp/wp-content/uploads/Skjermbilde-2012-05-11-kl.-09.24.25.png"><img class="aligncenter size-medium wp-image-16447" title="&#9835; &#9834; Odometer: PRF-info er samlet inn og vises i et eget vindu " src="http://hjelp/wp-content/uploads/Skjermbilde-2012-05-11-kl.-09.24.25-350x301.png" alt="" width="350" height="301"></a></p>
<p>Hvis du n&#229; ble skuffet over at dette ikke g&#229;r automatisk, men at man selv med Odometer m&#229; rote rundt med PRF, kan jeg tilby min sympati, og samtidig forh&#229;pentligvis roe gemyttene: <strong>Vi jobber med &#229; gj&#248;re dette helautomatisk</strong>, men inntil vi f&#229;r lagt alle r&#248;rene og klinket alle skj&#248;tene er denne melloml&#248;sningen det beste vi har.</p>
</div>
<h1>AUX-rapportering</h1>
<div>
<p>Som du kanskje vet, skal musikk fra produksjonsmusikkselskapet AUX <strong>rapporteres direkte til dem</strong>, i tillegg til at det skal inn til TONO. Ett trykk p&#229; <em>AUX-rapport</em> &#229;pner et nytt vindu hvor AUX-sporene legges inn i et web-skjema.</p>
<p style="text-align: center;"><a href="http://hjelp/wp-content/uploads/Skjermbilde-2012-05-11-kl.-09.24.07.png"><img class="aligncenter size-medium wp-image-16446" title="&#9835; &#9834; Odometer: rapportere til AUX (Sonoton)" src="http://hjelp/wp-content/uploads/Skjermbilde-2012-05-11-kl.-09.24.07-350x281.png" alt="" width="350" height="281"></a></p>
<p>Det skal bare fylles ut med kontaktinfo, s&#229;&#160;kan du sende rapporten av g&#229;rde. (Trykk <em>OK</em>, og deretter <em>Skicka</em>.)</p>
</div>
<h1>Lage rulletekst</h1>
<div>
<p>Som en ekstra bonus for at du har v&#230;rt s&#229; flink &#229; rapportere musikken, kan programmet lage en oversikt over musikkbruken som egner seg til bruk i rulletekst.</p>
</div>
<h1>Oppdatert AUX-katalog</h1>
<div>
<div id="attachment_16454" class="wp-caption alignright" style="width: 178px"><a href="http://hjelp/wp-content/uploads/Skjermbilde-2012-05-11-kl.-09.51.37.png"><img class="size-full wp-image-16454   " title="Metadata mangler, men AUX-oppslag er mulig" src="http://hjelp/wp-content/uploads/Skjermbilde-2012-05-11-kl.-09.51.37.png" alt="" width="168" height="161"></a><p class="wp-caption-text">Metadata mangler, men AUX-oppslag er mulig</p></div>
<p>For &#229; kunne kjenne igjen l&#229;ter som kommer fra AUX, har Odometer en <em>innebygget liste over kataloger hos AUX</em>. Katalogen oppdateres jevnlig, og da m&#229; ogs&#229; Odometer oppdatere sin interne katalog. Det skjer automatisk, ved at Odometer med passe jevne mellomrom sjekker katalogen p&#229; <em>auxmp.com</em>.</p>
<p>Hvis du har kommet over et spor som ikke Odometer kjenner igjen (men som kommer fra AUX), kan du tvinge programmet til &#229; sl&#229; opp dette sporet.</p>
<p>Dersom dette f&#248;rer fram, kommer det opp et vindu for &#229; sende inn den n&#248;dvendige infoen til utviklerne av Odometer.</p>
<p>Dette vil gj&#248;re det lettere for oss &#229; oppdatere katalogen og pushe det ut til alle odometerbrukere.</p>
</div>
<h1>Enn hvis jeg lurer p&#229; noe?</h1>
<div>
<p>Enn s&#229; lenge er Odometer under utvikling, og alle henvendelser kan rettes direkte til H&#229;vard Gulldahl (<em>havard.gulldahl@nrk.no</em>), som har utviklet programmet. Alt av kommentarer og sp&#248;rsm&#229;l mottas med stor takk &#8212; det vil gj&#248;re programmet bedre <img src="http://hjelp/wp-includes/images/smilies/icon_smile.gif" alt=":)" class="wp-smiley"></p>
</div>

								<p>Stikkord: <a href="http://hjelp/tag/aux/" rel="tag">aux</a>, <a href="http://hjelp/tag/musikkrapportering/" rel="tag">musikkrapportering</a>, <a href="http://hjelp/tag/prf/" rel="tag">PRF</a>, <a href="http://hjelp/tag/sonoton/" rel="tag">sonoton</a></p>
							</div>
